---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MassFailures.NonOccupiableMassZone
source: html/30176548-db94-de41-7049-c177f1a890bc.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MassFailures.NonOccupiableMassZone Property

For mass zone, if the bottom level ref does not intersect, then this zone is going to be "not occupiable" and a warning is posted for it.

## Syntax (C#)
```csharp
public static FailureDefinitionId NonOccupiableMassZone { get; }
```